

// 生活随笔的遍历

// text:''

const shengtext = [
    {
        title:'透明“铠甲”：钢化玻璃',
        url:'../img/恒源玻璃/成品展示1.jpg',
        text:'作为玻璃中的“硬汉”，它经过特殊的热处理工艺，强度是普通玻璃的3-5倍。就算遭受强力撞击，破碎后也呈钝角小颗粒状，不易伤人，为安全保驾护航，广泛应用于建筑门窗、汽车挡风玻璃等场景。'
    },
    {
        title:'安全护盾：夹胶玻璃',
        url:'../img/恒源玻璃/成品展示2.png',
        text:'两片或多片玻璃间夹有坚韧的PVB胶片，经高温高压粘合而成。遭受冲击时，玻璃碎片会被胶片粘住，不会飞溅四散，常用于天窗、幕墙以及地震多发地区建筑，给生活稳稳的安全保障。'
    },
    {
        title:'坚固之盾，抵御岁月侵袭',
        url:'../img/恒源玻璃/成品展示4.jpg',
        text:'精选高强度铝合金材质，质地坚韧，抗风抗压。同时具备出色抗腐蚀性，无惧日晒雨淋，长久使用也不易变形、褪色，为家提供长久守护。'
    },
    {
        title:'隔热能手：中空玻璃',
        url:'../img/恒源玻璃/成品展示5.png',
        text:'由两片或多片玻璃组合而成，中间是干燥的空气或惰性气体。这种独特结构让它成为隔热保温的行家，能有效阻挡热量传递，降低室内空调、暖气能耗，冬暖夏凉，是现代节能建筑的优选。'
    },

]

let sheng = ''
shengtext.forEach(item=>{
    sheng +=`

                    <div class="sheng-box">
                        <img src="${item.url}" alt="">
                        <a href="" class="sheng-text">
                            <h4>${item.title}</h4>
                            <h1>${item.text}</h1>
                                
                        </a>   
                </div>`

})

document.querySelector('.sheng').innerHTML = sheng




