

// 作品的遍历

const zpimgs =[
    {url:'../img/鑫旺门窗加工/成品展示1.jpg',title:'欧式双开'},
    {url:'../img/鑫旺门窗加工/成品展示2.jpg',title:'庭院大门'},
    {url:'../img/鑫旺门窗加工/成品展示3.jpg',title:'传统合金门'},
    {url:'../img/鑫旺门窗加工/成品展示4.jpg',title:'简约门楼'},
]
let arr = ''
// 获取作品介绍
zpimgs.forEach(item =>{
    console.log(item);
    
    arr+=`
        <li>
            <a href="">
                    <img src="${item.url}" alt="">
                    <p>${item.title}</p>
            </a>
        </li>

    `
})

document.querySelector('.mlb-zp ul').innerHTML = arr

// 生活随笔的遍历
// text:'',

const shengtext = [
    {
        title:'豪华铝合金门楼',
        url:'../img/鑫旺门窗加工/成品展示5.png',
        text:'铝合金是以铝为基，加入适量其他合金元素制成的金属材料。其密度约为钢材的三分之一，这使得铝合金大门在保证强度的同时，质量轻盈，便于安装与日常使用。',
    },
    {
        title:'简约铝合金门楼',
        url:'../img/鑫旺门窗加工/成品展示6.png',
        text:'选择符合国家标准的铝合金型材，根据大门的设计规格进行切割。切割过程需精准控制尺寸，误差控制在极小范围内，以确保后续组装的精度。',
    },
    {
        title:'古典蓝门楼',
        url:'../img/鑫旺门窗加工/成品展示7.png',
        text:'铝合金表面处理是提升其美观度与耐久性的关键环节。常用的处理方式有阳极氧化、电泳涂装和粉末喷涂。阳极氧化使铝合金表面形成一层坚硬的氧化膜，不仅增强耐腐蚀性，还具有独特的金属光泽',
    },
    {
        title:'经典黑铝合金门楼',
        url:'../img/鑫旺门窗加工/成品展示8.png',
        text:'大门的配件如合页、把手、锁具等，同样经过严格的加工与质量检测。合页需具备足够的承重能力与灵活性，确保大门开关顺畅通过焊接、铆接或螺丝紧固等方式，确保大门结构牢固。',
        
    },
    {
        title:'古金色铝合金门楼',
        url:'../img/鑫旺门窗加工/成品展示9.png',
        text:' 对铝合金农村大门进行全面质量检测。外观检查包括表面平整度、颜色均匀度、有无瑕疵等；结构性能测试则检验大门的开合顺畅度、密封性、抗风压能力等。',
    },
    {
        title:' 经典庭院门楼',
        url:'../img/鑫旺门窗加工/成品展示10.png',
        text:'铝合金大门坚固耐用，配合优质的锁具，能有效抵御外力入侵，为农村家庭提供可靠的安全保障。其框架结构稳定，不易被破坏，相比传统木门或普通铁门，防盗性能大幅提升。',
    },
    {
        title:'抛光砖',
        url:'../img/鑫旺门窗加工/成品展示11.png',
        text:'可根据不同的建筑风格进行设计，线条流畅，造型多样。从简约现代到复古欧式，从田园风格到中式传统，都能通过铝合金材质与表面处理工艺完美呈现，为农村住宅增添独特的装饰效果。',
    },
    {
        title:'玻化砖',
        url:'../img/鑫旺门窗加工/成品展示4.jpg',
        text:'由于铝合金的耐腐蚀性和稳定性，日常只需简单清洁，无需定期刷漆、保养，大大降低了使用过程中的维护成本。即使长期暴露在户外，也能保持良好的外观与性能。',
    },
    {
        title:'质量判断',
        url:'../img/鑫旺门窗加工/成品展示2.jpg',
        text:' 铝合金农村大门以其优良的材料特性、严谨的生产工艺、显著的优势特点和贴心的定制服务，成为农村住宅大门的理想选择。它不仅为农村家庭带来了安全与美观，更体现了现代建筑材料与工艺在乡村建设中的应用与发展，为农村生活品质的提升贡献力量。随着技术的不断进步与市场需求的日益增长，铝合金农村大门将在未来的农村建筑领域展现出更加广阔的发展前景，持续为农村住宅增添光彩。',
    },
   

]
let sheng = ''
shengtext.forEach(item=>{
    sheng +=`

                    <div class="sheng-box">
                        <img src="${item.url}" alt="">
                        <a href="" class="sheng-text">
                            <h4>${item.title}</h4>
                            <h1>${item.text}</h1>
                                
                        </a>   
                </div>`

})

document.querySelector('.sheng').innerHTML = sheng




